content/blog/joining-the-royal-marines.md
+++
title = "I joined the Royal Marines 19 years ago today"
author = ["Ben Ford"]
publishDate = 2019-05-01T00:00:00+01:00
lastmod = 2019-05-04T09:57:27+01:00
tags = ["blog"]
draft = true
+++

So it's as good an opportunity as any to reflect on some of lessons that incredibly
intense period of my life taught me.


## Standards matter {#standards-matter}

How does a new hire experience joining your organisation? How do you impart the
culture, values and mission of your company? Do you even have a common
understanding of what those are?

The Royal Marines take a bunch of very different individuals off the street
every two weeks to form a recruit troop of about 30. These men (still only men
for the time being) come from all walks and stages of life from the 16 year old
who's never left home before to someone in their late 20s who's had half a
career already. The corps then applies a process that in 7 months or so spits
about half of them out of the other end as elite commandos.

The men that pass out of basic training with their green berets are completely
different individuals from those that started. They've put on probably about a
stone of muscle and are capable of things they couldn't comprehend doing just
over half a year ago.

And it starts on day 1 week 1 with lesson 1: **How to wash.**

Yep. As a grown man striving to become an elite Royal Marine Commando the very
first thing you get shown is how to correctly wash your balls. Literally.

What kind of message is this sending?

The main one (which was compounded on a daily basis) is that there is an
expected standard and that standard is to be reached by everyone. No exceptions.


### Takeaway {#takeaway}

Onboarding is essential. How people experience their first few interactions as a
new member of the team will shape everything to come.


## Knowledge is not the same as skill {#knowledge-is-not-the-same-as-skill}

When we received lesson #1 it wasn't a description. The whole troop shuffled
into the ablutions in towels and flip flops and our drill instructor physically
showed us. And then watched while we did it. This was the pattern for almost
every lesson. Very little theory, start doing immediately based on a clear
understanding of what's required.

**Show. Try. Correct. Repeat.**

Contrast this with how I went about learning my current programming language of
choice [Haskell](https://www.haskell.org/): Read a book, read another book. Read a couple of academic papers
that deepen concepts in the books. I built up quite a lot of knowledge, and I
couldn't actually write Haskell for shit. That knowledge didn't start to
solidify into skill until I Actually. Started. Doing!

It's true that knowledge compounds, but knowledge doesn't really stick until
it's solidified with practice. The other observation here is that the order in
which you learn skills vs acquire knowledge is different and complimentary in
many ways.


### Skills compose small to large {#skills-compose-small-to-large}

In the Royal Marines one example of this is:

-   Personal Discipline
-   Attention to Detail
-   Dry weapon handling
-   Live fire on the range
-   Dry section drills
-   Live section attacks in the field

Each skill builds upon and requires mastery of the one before.

What would this look like if we taught programming like this?

-   Bash
-   Git
-   How to use github
-   Editor/IDE set up and efficiency
-   Programming language
-   Algorithms

Almost the exact opposite of how most people traditionally learn :-)


### Knowledge is deconstructed large to small {#knowledge-is-deconstructed-large-to-small}

Often when we are taught something in an academic context it's presented as a
large concepts and broken down iteratively. This kind of iterative breakdown
also works really well for breaking down large scale plans and mission:

-   Purpose
-   Vision
-   Mission
-   Current Priority
-   Tasks


### Takeaways {#takeaways}

Bottom up skill building and top down knowledge breakdown compliment each other.

Think about how skills are developed and nurtured, after all:

> We don't rise to the level of our expectations, we fall to the level of our
> training -- Archilochus


## Everyone leads {#everyone-leads}

One of the key concepts in modern militaries is the concept of **mission
command**. Gen Stan McChrystal calls it empowered execution, Jocko Willink refers
to it as decentralised command.

No matter what you call it, the idea is that decision making should happen with
the people at the edges of the organisation - the ones in the fight. That means
that everyone is a leader. As the pace of change or level of uncertainty
increases, this becomes more and more essential.


## Summary {#summary}

This is getting a bit too long. There's a whole lot more to cover on what businesses
and tech can learn from military strategy and tactics. Conflict is a crucible
that distils only the essential and our best teachers in navigating modern
complexity may well be those whose writing has been tested the longest:

-   Musashi
-   Sun Tzu
-   John Boyd

Let me know in the comments, or [twitter](https://twitter.com/commandodev) what else you'd like to hear about.
